Revit 2024 API
PulldownButton.AddSeparator Method
Adds a separator to the drop-down list.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void AddSeparator()
Visual Basic
Public Sub AddSeparator
Visual C++
public:
void AddSeparator()
Remarks
The separator will appear just below the last added PushButton.
See Also
PulldownButton Class
Autodesk.Revit.UI Namespace